In [1]:
import pandas as pd
df = pd.read_csv("Motorola.csv")

In [15]:
df.head()

   Year   Company  Revenue (in millions)  Profit (in millions)
0  1955  Motorola                  205.2                   7.6
1  1956  Motorola                  226.7                   8.5
2  1957  Motorola                  227.6                   8.0
3  1958  Motorola                  226.4                   7.8
4  1959  Motorola                  216.6                   7.4

In [16]:
students = {"Data Analytics": 
["Patrizia",
"Rabeea",
"Bibian"], 
"Business": [
{"Brian": [
            "Intro to business",
            "Law and Ethics"
        ]}
    ]
        }

In [17]:
students["Business"][0]["Brian"]

['Intro to business', 'Law and Ethics']

## MySQL

In [18]:
#!pip install mysql-connector-python

In [2]:
import mysql.connector

In [3]:
host="localhost" # "127.0.0.1"
user="pda2023" # root
password="pda2023" # root password

In [4]:
db = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    #port=3306
)
print(db)

<mysql.connector.connection.MySQLConnection object at 0x0000019BFDE486A0>

In [5]:
conn = db.cursor()

In [23]:
#conn.execute("CREATE DATABASE students;")

In [24]:
conn.execute("SHOW DATABASES;")

In [25]:
for result in conn:
    print(result)

('bank',)
('companies',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('students',)
('sys',)
('testdb',)
('trades',)
('world',)
('world_cup',)

In [26]:
conn.execute("USE students;")

In [27]:
conn.close()

True

In [28]:
db = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    #port=3306,
    database="students"
)
conn = db.cursor()

In [29]:
#conn.execute("CREATE DATABASE students;")
conn.execute("CREATE DATABASE IF NOT EXISTS students;")

In [30]:
conn.execute("CREATE TABLE IF NOT EXISTS test (id INT);")

In [31]:
conn.execute("CREATE TABLE IF NOT EXISTS students (name VARCHAR(255), age INT, studentNum INT PRIMARY KEY);")

In [32]:
conn.execute("SHOW TABLES;")
for result in conn:
    print(result)

('students',)
('test',)
('test2',)

In [41]:
for result in conn:
    print(result)

In [46]:
userName = "' OR 1=1 --"
userName

"' OR 1=1 --"

In [48]:
#userName = input("What is your username?")
userName = "' OR 1=1 --"
print(userName)
statement = f"SELECT * FROM students WHERE name='{userName}';"
print(statement)
statement
# conn.execute(statement)
# for result in conn:
#     print(result)

' OR 1=1 --
SELECT * FROM students WHERE name='' OR 1=1 --';

"SELECT * FROM students WHERE name='' OR 1=1 --';"

('Sam', 49, 123)
('Joe', 49, 124)

In [33]:
conn.execute("INSERT INTO students (name, age, studentNum) VALUES ('Sam', 49, 123)")

IntegrityError: 1062 (23000): Duplicate entry '123' for key 'students.PRIMARY'

In [ ]:
conn.execute("INSERT INTO students (name, age, studentNum) VALUES ('Sam', 49, 124)")

In [ ]:
conn.execute("SELECT * FROM students;")
for result in conn:
    print(result)

In [ ]:
conn.execute("SELECT * FROM students WHERE studentNum=123;")
for result in conn:
    print(result)

In [ ]:
conn.execute("SELECT name FROM students WHERE studentNum=123;")
for result in conn:
    print(result)

In [ ]:
db.commit()

In [ ]:
conn.execute("UPDATE students SET name='Joe' WHERE studentNum=124;")

In [ ]:
conn.execute("SELECT * FROM students;")
for result in conn:
    print(result)

In [ ]:
db.commit()

In [ ]:
conn.close()

# Exercise 1

Create a new table called programmes

The columns are the programme name (primary key), as well as up to 6 modules

Insert the MSc Data Analytics with the modules for this semester

In [6]:
conn.execute("CREATE DATABASE programmes;")

In [9]:
conn.execute("USE programmes;")

In [10]:
conn.execute("CREATE TABLE programmes (name VARCHAR(50) PRIMARY KEY, module1 VARCHAR(50),module2 VARCHAR(50),module3 VARCHAR(50),module4 VARCHAR(50),module5 VARCHAR(50),module6 VARCHAR(50));")

In [12]:
conn.execute("INSERT INTO programmes (name, module1, module2, module3, module4) VALUES ('MSc Data Analytics', 'Programming for Data Analyitics', 'Data Visualisation and Preperation', 'Machine Learning', 'Statistics');")

In [13]:
conn.execute("SELECT * FROM programmes;")
for result in conn:
    print(result)

('MSc Data Analytics', 'Programming for Data Analyitics', 'Data Visualisation and Preperation', 'Machine Learning', 'Statistics', None, None)

In [14]:
db.commit()

# Exercise 2

Read one of the company csv files

Store it in a table in a **new** database

In [17]:
conn.execute("DROP DATABASE companies;")

In [18]:
conn.execute("CREATE DATABASE companies;")

In [19]:
conn.execute("USE companies;")

In [20]:
df.head()

   Year   Company  Revenue (in millions)  Profit (in millions)
0  1955  Motorola                  205.2                   7.6
1  1956  Motorola                  226.7                   8.5
2  1957  Motorola                  227.6                   8.0
3  1958  Motorola                  226.4                   7.8
4  1959  Motorola                  216.6                   7.4

In [21]:
conn.execute("CREATE TABLE motorola (Year INT, Company VARCHAR(50), Revenue DOUBLE, Profit DOUBLE);")

In [25]:
type(df.iloc[0,1])

str

In [26]:
df.iloc[0,1]

'Motorola'

In [27]:
conn.execute(f"INSERT INTO motorola (Year, Company, Revenue, Profit) VALUES ({df.iloc[0,0]}, '{df.iloc[0,1]}', {df.iloc[0, 2]}, {df.iloc[0,3]});")

In [28]:
db.commit()

In [30]:
df.size

204

In [33]:
df.shape[0]

51

In [31]:
for row in range(1, df.size): # shape[0]
    conn.execute(f"INSERT INTO motorola (Year, Company, Revenue, Profit) VALUES ({df.iloc[row,0]}, '{df.iloc[row,1]}', {df.iloc[row, 2]}, {df.iloc[row,3]});")
db.commit()

IndexError: index 51 is out of bounds for axis 0 with size 51

In [34]:
db.commit()

In [35]:
conn.execute("SELECT * FROM motorola;")
for result in conn:
    print(result)

(1955, 'Motorola', 205.2, 7.6)
(1956, 'Motorola', 226.7, 8.5)
(1957, 'Motorola', 227.6, 8.0)
(1958, 'Motorola', 226.4, 7.8)
(1959, 'Motorola', 216.6, 7.4)
(1960, 'Motorola', 289.5, 14.2)
(1961, 'Motorola', 299.1, 12.6)
(1962, 'Motorola', 298.2, 9.5)
(1963, 'Motorola', 346.9, 13.2)
(1964, 'Motorola', 377.9, 12.9)
(1965, 'Motorola', 419.1, 20.7)
(1966, 'Motorola', 517.0, 31.8)
(1967, 'Motorola', 682.4, 33.0)
(1968, 'Motorola', 630.0, 18.8)
(1969, 'Motorola', 775.1, 28.3)
(1970, 'Motorola', 873.2, 33.8)
(1971, 'Motorola', 796.4, 24.2)
(1972, 'Motorola', 926.6, 31.8)
(1973, 'Motorola', 1163.3, 52.0)
(1974, 'Motorola', 1437.1, 82.0)
(1975, 'Motorola', 1367.2, 70.7)
(1976, 'Motorola', 1311.8, 41.1)
(1977, 'Motorola', 1494.1, 85.4)
(1978, 'Motorola', 1833.9, 106.3)
(1979, 'Motorola', 2219.7, 125.2)
(1980, 'Motorola', 2713.8, 154.3)
(1981, 'Motorola', 3098.8, 186.1)
(1982, 'Motorola', 3335.9, 175.0)
(1983, 'Motorola', 3785.8, 178.0)
(1984, 'Motorola', 4328.0, 244.0)
(1985, 'Motorola', 5534.0, 387.0)
(1986, 'Motorola', 5443.0, 72.0)
(1987, 'Motorola', 5888.0, 194.0)
(1988, 'Motorola', 6707.0, 308.0)
(1989, 'Motorola', 8250.0, 445.0)
(1990, 'Motorola', 9620.0, 498.0)
(1991, 'Motorola', 10885.0, 499.0)
(1992, 'Motorola', 11341.0, 454.0)
(1993, 'Motorola', 13341.0, 453.0)
(1994, 'Motorola', 16963.0, 1022.0)
(1995, 'Motorola', 22245.0, 1560.0)
(1996, 'Motorola', 27037.0, 1781.0)
(1997, 'Motorola', 27973.0, 1154.0)
(1998, 'Motorola', 29794.0, 1180.0)
(1999, 'Motorola', 29398.0, -962.0)
(2000, 'Motorola', 30931.0, 817.0)
(2001, 'Motorola', 37580.0, 1318.0)
(2002, 'Motorola', 30004.0, -3937.0)
(2003, 'Motorola', 26679.0, -2485.0)
(2004, 'Motorola', 27058.0, 893.0)
(2005, 'Motorola', 35349.0, 1532.0)

In [36]:
conn.execute("UPDATE motorola SET Company = 'Nokia';")

In [39]:
def read_table(table='motorola'):
    conn.execute(f"SELECT * FROM {table};")
    for result in conn:
        print(result)

In [40]:
read_table()

(1955, 'Nokia', 205.2, 7.6)
(1956, 'Nokia', 226.7, 8.5)
(1957, 'Nokia', 227.6, 8.0)
(1958, 'Nokia', 226.4, 7.8)
(1959, 'Nokia', 216.6, 7.4)
(1960, 'Nokia', 289.5, 14.2)
(1961, 'Nokia', 299.1, 12.6)
(1962, 'Nokia', 298.2, 9.5)
(1963, 'Nokia', 346.9, 13.2)
(1964, 'Nokia', 377.9, 12.9)
(1965, 'Nokia', 419.1, 20.7)
(1966, 'Nokia', 517.0, 31.8)
(1967, 'Nokia', 682.4, 33.0)
(1968, 'Nokia', 630.0, 18.8)
(1969, 'Nokia', 775.1, 28.3)
(1970, 'Nokia', 873.2, 33.8)
(1971, 'Nokia', 796.4, 24.2)
(1972, 'Nokia', 926.6, 31.8)
(1973, 'Nokia', 1163.3, 52.0)
(1974, 'Nokia', 1437.1, 82.0)
(1975, 'Nokia', 1367.2, 70.7)
(1976, 'Nokia', 1311.8, 41.1)
(1977, 'Nokia', 1494.1, 85.4)
(1978, 'Nokia', 1833.9, 106.3)
(1979, 'Nokia', 2219.7, 125.2)
(1980, 'Nokia', 2713.8, 154.3)
(1981, 'Nokia', 3098.8, 186.1)
(1982, 'Nokia', 3335.9, 175.0)
(1983, 'Nokia', 3785.8, 178.0)
(1984, 'Nokia', 4328.0, 244.0)
(1985, 'Nokia', 5534.0, 387.0)
(1986, 'Nokia', 5443.0, 72.0)
(1987, 'Nokia', 5888.0, 194.0)
(1988, 'Nokia', 6707.0, 308.0)
(1989, 'Nokia', 8250.0, 445.0)
(1990, 'Nokia', 9620.0, 498.0)
(1991, 'Nokia', 10885.0, 499.0)
(1992, 'Nokia', 11341.0, 454.0)
(1993, 'Nokia', 13341.0, 453.0)
(1994, 'Nokia', 16963.0, 1022.0)
(1995, 'Nokia', 22245.0, 1560.0)
(1996, 'Nokia', 27037.0, 1781.0)
(1997, 'Nokia', 27973.0, 1154.0)
(1998, 'Nokia', 29794.0, 1180.0)
(1999, 'Nokia', 29398.0, -962.0)
(2000, 'Nokia', 30931.0, 817.0)
(2001, 'Nokia', 37580.0, 1318.0)
(2002, 'Nokia', 30004.0, -3937.0)
(2003, 'Nokia', 26679.0, -2485.0)
(2004, 'Nokia', 27058.0, 893.0)
(2005, 'Nokia', 35349.0, 1532.0)

In [41]:
conn.execute("DELETE FROM motorola WHERE Year=2005;")

In [42]:
read_table()

(1955, 'Nokia', 205.2, 7.6)
(1956, 'Nokia', 226.7, 8.5)
(1957, 'Nokia', 227.6, 8.0)
(1958, 'Nokia', 226.4, 7.8)
(1959, 'Nokia', 216.6, 7.4)
(1960, 'Nokia', 289.5, 14.2)
(1961, 'Nokia', 299.1, 12.6)
(1962, 'Nokia', 298.2, 9.5)
(1963, 'Nokia', 346.9, 13.2)
(1964, 'Nokia', 377.9, 12.9)
(1965, 'Nokia', 419.1, 20.7)
(1966, 'Nokia', 517.0, 31.8)
(1967, 'Nokia', 682.4, 33.0)
(1968, 'Nokia', 630.0, 18.8)
(1969, 'Nokia', 775.1, 28.3)
(1970, 'Nokia', 873.2, 33.8)
(1971, 'Nokia', 796.4, 24.2)
(1972, 'Nokia', 926.6, 31.8)
(1973, 'Nokia', 1163.3, 52.0)
(1974, 'Nokia', 1437.1, 82.0)
(1975, 'Nokia', 1367.2, 70.7)
(1976, 'Nokia', 1311.8, 41.1)
(1977, 'Nokia', 1494.1, 85.4)
(1978, 'Nokia', 1833.9, 106.3)
(1979, 'Nokia', 2219.7, 125.2)
(1980, 'Nokia', 2713.8, 154.3)
(1981, 'Nokia', 3098.8, 186.1)
(1982, 'Nokia', 3335.9, 175.0)
(1983, 'Nokia', 3785.8, 178.0)
(1984, 'Nokia', 4328.0, 244.0)
(1985, 'Nokia', 5534.0, 387.0)
(1986, 'Nokia', 5443.0, 72.0)
(1987, 'Nokia', 5888.0, 194.0)
(1988, 'Nokia', 6707.0, 308.0)
(1989, 'Nokia', 8250.0, 445.0)
(1990, 'Nokia', 9620.0, 498.0)
(1991, 'Nokia', 10885.0, 499.0)
(1992, 'Nokia', 11341.0, 454.0)
(1993, 'Nokia', 13341.0, 453.0)
(1994, 'Nokia', 16963.0, 1022.0)
(1995, 'Nokia', 22245.0, 1560.0)
(1996, 'Nokia', 27037.0, 1781.0)
(1997, 'Nokia', 27973.0, 1154.0)
(1998, 'Nokia', 29794.0, 1180.0)
(1999, 'Nokia', 29398.0, -962.0)
(2000, 'Nokia', 30931.0, 817.0)
(2001, 'Nokia', 37580.0, 1318.0)
(2002, 'Nokia', 30004.0, -3937.0)
(2003, 'Nokia', 26679.0, -2485.0)
(2004, 'Nokia', 27058.0, 893.0)

In [43]:
db.commit()

In [44]:
# 2004
year = input("What year would you like to delete?")
conn.execute(f"DELETE FROM motorola WHERE Year={year};")
read_table()

What year would you like to delete?2004
(1955, 'Nokia', 205.2, 7.6)
(1956, 'Nokia', 226.7, 8.5)
(1957, 'Nokia', 227.6, 8.0)
(1958, 'Nokia', 226.4, 7.8)
(1959, 'Nokia', 216.6, 7.4)
(1960, 'Nokia', 289.5, 14.2)
(1961, 'Nokia', 299.1, 12.6)
(1962, 'Nokia', 298.2, 9.5)
(1963, 'Nokia', 346.9, 13.2)
(1964, 'Nokia', 377.9, 12.9)
(1965, 'Nokia', 419.1, 20.7)
(1966, 'Nokia', 517.0, 31.8)
(1967, 'Nokia', 682.4, 33.0)
(1968, 'Nokia', 630.0, 18.8)
(1969, 'Nokia', 775.1, 28.3)
(1970, 'Nokia', 873.2, 33.8)
(1971, 'Nokia', 796.4, 24.2)
(1972, 'Nokia', 926.6, 31.8)
(1973, 'Nokia', 1163.3, 52.0)
(1974, 'Nokia', 1437.1, 82.0)
(1975, 'Nokia', 1367.2, 70.7)
(1976, 'Nokia', 1311.8, 41.1)
(1977, 'Nokia', 1494.1, 85.4)
(1978, 'Nokia', 1833.9, 106.3)
(1979, 'Nokia', 2219.7, 125.2)
(1980, 'Nokia', 2713.8, 154.3)
(1981, 'Nokia', 3098.8, 186.1)
(1982, 'Nokia', 3335.9, 175.0)
(1983, 'Nokia', 3785.8, 178.0)
(1984, 'Nokia', 4328.0, 244.0)
(1985, 'Nokia', 5534.0, 387.0)
(1986, 'Nokia', 5443.0, 72.0)
(1987, 'Nokia', 5888.0, 194.0)
(1988, 'Nokia', 6707.0, 308.0)
(1989, 'Nokia', 8250.0, 445.0)
(1990, 'Nokia', 9620.0, 498.0)
(1991, 'Nokia', 10885.0, 499.0)
(1992, 'Nokia', 11341.0, 454.0)
(1993, 'Nokia', 13341.0, 453.0)
(1994, 'Nokia', 16963.0, 1022.0)
(1995, 'Nokia', 22245.0, 1560.0)
(1996, 'Nokia', 27037.0, 1781.0)
(1997, 'Nokia', 27973.0, 1154.0)
(1998, 'Nokia', 29794.0, 1180.0)
(1999, 'Nokia', 29398.0, -962.0)
(2000, 'Nokia', 30931.0, 817.0)
(2001, 'Nokia', 37580.0, 1318.0)
(2002, 'Nokia', 30004.0, -3937.0)
(2003, 'Nokia', 26679.0, -2485.0)

In [45]:
# 2003 OR 1=1 --
# comment in SQL is --
year = input("What year would you like to delete?")
conn.execute(f"DELETE FROM motorola WHERE Year={year};")
read_table()

What year would you like to delete?2003 OR 1=1 --

In [46]:
read_table()

In [47]:
db.commit()

In [ ]:
# where year = 2003 OR 1=1